#define  _CRT_SECURE_NO_WARNINGS 1

#include<stdio.h>
//sizeof() 计算变量所占内存空间的大小
int main() {
	int a = 10;
	char c = 'r';
	char* p = &c;
	int arr[10] = { 0 };
	//sizeof计算的变量所占内存空间的大小，单位字节
	printf("%d\n",sizeof(a)); //4
	printf("%d\n", sizeof(int)); //4

	printf("%d\n", sizeof(c)); //1
	printf("%d\n", sizeof(char)); //1

	printf("%d\n", sizeof(p)); //8 64位电脑为8
	printf("%d\n", sizeof(char*)); //8 

	printf("%d\n", sizeof(arr)); //40
	printf("%d\n", sizeof(int [10])); //40 int [10]为数组类型
	return 0;
}


//取地址操作符
//int main() {
//	int a = 10;
//	int* p = &a; //取地址操作符
//	*p = 20;//解引用操作符
//
//	return 0;
//}


//单目运算符
//int main() {
//	int a = 0;
//	if (a) //a为真打印hehe
//	{
//		printf("hehe\n");
//	}
//	if (!a) //a为假打印hehe
//	{
//		printf("hehe\n");
//	}
//	return 0;
//}


//复合赋值符
//int main() {
//	int a = 10;
//	printf("加\n", a);
//	a = a + 2;
//	printf("a + 2 = %d\n", a);
//	a += 2;
//	printf("a += 2 = %d\n", a);
//
//	printf("右移\n", a);
//	a = a >> 1;
//	printf("a >> 1 = %d\n", a);
//	a >>= 1;
//	printf("a >>=1 = %d\n", a);
//
//	printf("与\n", a);
//	a = a & 1;
//	printf("a & 1 = %d\n", a);
//	a &= 1;
//	printf("a &= 1 = %d\n", a);
//
//	return 0;
//}


//求一个整数存储在内存中的二进制1的个数
//int main() {
//	int num = 0;
//	int count = 0;
//	scanf("%d",&num); //-1
//	////求num补码中有几个1
//	////得到十进制数每位：123 % 10 = 3 123/ 10 = 12
//	////12 % 10 = 2(十位) 12/10 = 1(百位)
//	////故补码：不断模2除2
//	////3 - 011
//	//while (num !=0)
//	//{
//	//	if (num % 2 == 1) {
//	//		count++;
//	//	}
//	//	num = num / 2;
//	//}
//	//printf("%d\n", count);
//
//	//拿到32bit
//	// 与1按位与的结果
//	//00000000000000000000000000000010
//	//00000000000000000000000000000001
//	//00000000000000000000000000000000
//	//得到任何1位：把num右移，按位与，得到1说明该位为1
//	int i = 0;
//	for ( i = 0; i < 32; i++)
//	{
//		if (1 == ((num >> i) & 1))
//			count++;
//
//	}
//	printf("%d\n", count);
//
//	return 0;
//}


//交换两个变量的值，不使用局部变量
//int main() {
//	int a = 5;
//	int b = 3;
//	//int tmp = 0;//临时变量
//	printf("before:a = %d,b = %d\n",a,b);
//	//tmp = a;
//	//a = b;
//	//b = tmp;
//	//加减法 - 缺陷：a和b是int，最多4个字节，较大数相加可能会溢出
//	a = a + b;//放和
//	b = a - b;//原来a的值
//	a = a - b;//原来b的值
//	printf("加减法 after:a = %d,b = %d\n", a, b);
//	//此时 a=3,b=5
//	//异或
//	//a :011
//	//b: 101
//	//异或：110 a =6
//	a = a ^ b; //a=6,b=5
//	//b=a^b=011  b=3
//	b = a ^ b; //a=6,b=3
//	//a=a^b 101 a=5
//	a = a ^ b;
//	printf("异或 after:a = %d,b = %d\n", a, b);
//	return 0;
//}


//int main() {
//	//& - 按2进制位与(均真才真)
//	int a = 3;
//	int b = 5;
//	//按位与
//	//00000000000000000000000000000011
//	//00000000000000000000000000000101
//	//00000000000000000000000000000001
//	int c = a & b;
//	printf("%d\n", c); //1
//	//  |  按位或 两假才假
//	//00000000000000000000000000000011
//	//00000000000000000000000000000101
//	//00000000000000000000000000000111
//	c = a | b;//按位或
//	printf("%d\n", c); //7
//
//	//按二进制异或(相同为0，相异为1)
//	//00000000000000000000000000000011
//	//00000000000000000000000000000101
//	//00000000000000000000000000000110
//	c = a ^ b; 
//	printf("%d\n", c); //6
//	return 0;
//}

//int main() {
//	//<< 左移：直接补0
//	int a = 5;
//	int b = a << 1;
//	//
//	return 0;
//}


//int main() {
//	int a = -1;
//	//整数的二进制表示有：原码、反码、补码
//	//存储到内存的是补码
//	//10000000000000000000000000000001 原码
//	//11111111111111111111111111111110 反码(符号位不变，其他按位取反)
//	//11111111111111111111111111111111 补码 (反码+1)
//	int b = a >> 1;
//	//移位补了1，输出还是-1
//	printf("%d",b);
//	return 0;
//}


//int main() {
//	int a = 16;
//	// >>  -- 右移操作符(算术右移)
//	//移动的是二进制位
//	//16:2^4
//	//10000
//	//00000000000000000000000000010000
//	int b = a >> 1;
//	return 0;
//}


//int main() {
//	//int a = 5 / 2; //商2余1,此时结果是2
//	double a = 5 / 2.0;//商是小数
//	//printf("a = %d\n", a);
//	printf("a = %lf\n", a);
//	return 0;
//}